In [1]:
import pandas as pd
import numpy as np
from datetime import datetime
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [2]:
# read the data
df = pd.read_csv('../inputs/train.csv')
df_challenge = pd.read_csv('../inputs/challenge_data.csv')

In [3]:
df.head(5)

  user_sequence  user_id  challenge_sequence challenge
0        4576_1     4576                   1   CI23714
1        4576_2     4576                   2   CI23855
2        4576_3     4576                   3   CI24917
3        4576_4     4576                   4   CI23663
4        4576_5     4576                   5   CI23933

In [4]:
df_challenge.head(5)

,challenge_ID,programming_language,challenge_series_ID,total_submissions,publish_date,author_ID,author_gender,author_org_ID,category_id
0,CI23478,2,SI2445,37.0,06-05-2006,AI563576,M,AOI100001,NaN
1,CI23479,2,SI2435,48.0,17-10-2002,AI563577,M,AOI100002,32.0
2,CI23480,1,SI2435,15.0,16-10-2002,AI563578,M,AOI100003,NaN
3,CI23481,1,SI2710,236.0,19-09-2003,AI563579,M,AOI100004,70.0
4,CI23482,2,SI2440,137.0,21-03-2002,AI563580,M,AOI100005,NaN

In [8]:
# unique users in train data
print ('unique users in train', len(df['user_id'].unique()))

# unique challenges in train
print ('unique challenges in train', len(df['challenge'].unique()))

print ()
# unique challenges in challenge data
print ('unique challenges in challenge data', len(df_challenge['challenge_ID'].unique()))

# unique series in challenge dataq
print ('unique series in challenge data', len(df_challenge['challenge_series_ID'].unique()))

# unique programming languages
print ('unique programming languages', len(df_challenge['programming_language'].unique()))

unique users in train 69532
unique challenges in train 5348

unique challenges in challenge data 5606
unique series in challenge data 436
unique programming languages 3

In [10]:
df_challenge['publish_date'] = df_challenge['publish_date'].apply(lambda x: x[6:] + '-' + x[3:5] + '-' + x[0:2])

In [11]:
# max of publish date
print ('max of publish date', max(df_challenge['publish_date']))

# min of publish date
print ('max of publish date', min(df_challenge['publish_date']))

# max no of submissions
print ('max of submissions', max(df_challenge['total_submissions']))

# min no of submissions
print ('min of submissions', min(df_challenge['total_submissions']))

max of publish date 2010-06-25
max of publish date 1999-08-26
max of submissions 43409.0
min of submissions 2.0

In [12]:
## merge the dataframes
df_train = pd.merge(left = df, right = df_challenge, how = 'left', left_on = ['challenge'], right_on = ['challenge_ID'])

In [13]:
df_train.head(5)

,user_sequence,user_id,challenge_sequence,challenge,challenge_ID,programming_language,challenge_series_ID,total_submissions,publish_date,author_ID,author_gender,author_org_ID,category_id
0,4576_1,4576,1,CI23714,CI23714,1,SI2477,14723.0,2006-06-12,AI563766,M,AOI100129,29.0
1,4576_2,4576,2,CI23855,CI23855,1,SI2468,20993.0,2006-07-24,AI563823,M,NaN,29.0
2,4576_3,4576,3,CI24917,CI24917,1,SI2545,43409.0,2007-07-02,AI564588,F,AOI100581,66.0
3,4576_4,4576,4,CI23663,CI23663,1,SI2472,8897.0,2004-09-15,AI563724,M,AOI100098,45.0
4,4576_5,4576,5,CI23933,CI23933,1,SI2468,15086.0,2006-07-27,AI563783,M,AOI100149,31.0

In [21]:
## get user preferance for programming language
program_dict = {1:1, 2:2, 3:4} # for binary conversion
df_temp = df_train.groupby(['user_id', 'programming_language']).count()['user_sequence'].reset_index()
df_temp = df_temp.sort_values(by = ['user_id', 'programming_language'])
df_temp['programming_language'] = df_temp['programming_language'].apply(lambda x: program_dict[x])
df_temp = df_temp.groupby(['user_id']).sum()['programming_language'].reset_index()
df_temp = df_temp.groupby(['programming_language']).count()['user_id'].reset_index()
print (df_temp)

## majority of the users prefer language no 1

   programming_language  user_id
0                     1    68104
1                     2       24
2                     3      998
3                     4       22
4                     5      343
5                     6        2
6                     7       39

In [27]:
## check the time duration between the challenges solved by users
## first check if the challenges are in increasing time order for some random users
print (df_train.loc[df_train['user_id'] == 4576, ['challenge_sequence', 'challenge', 'challenge_series_ID', 'publish_date']])
print (df_train.loc[df_train['user_id'] == 6576, ['challenge_sequence', 'challenge', 'challenge_series_ID', 'publish_date']])

    challenge_sequence challenge challenge_series_ID publish_date
0                    1   CI23714              SI2477   2006-06-12
1                    2   CI23855              SI2468   2006-07-24
2                    3   CI24917              SI2545   2007-07-02
3                    4   CI23663              SI2472   2004-09-15
4                    5   CI23933              SI2468   2006-07-27
5                    6   CI25135              SI2556   2007-08-25
6                    7   CI23975              SI2462   2005-01-24
7                    8   CI25126              SI2556   2007-08-21
8                    9   CI24915              SI2545   2007-07-02
9                   10   CI24957              SI2545   2007-07-06
10                  11   CI24958              SI2545   2007-07-09
11                  12   CI23667              SI2463   2003-08-06
12                  13   CI23691              SI2469   2005-05-25
       challenge_sequence challenge challenge_series_ID publish_date
16549                   1   CI26164              SI2634   1999-10-01
16550                   2   CI26174              SI2634   1999-10-29
16551                   3   CI26208              SI2634   1999-11-03
16552                   4   CI26211              SI2634   1999-11-10
16553                   5   CI26210              SI2634   1999-11-08
16554                   6   CI26209              SI2634   1999-11-05
16555                   7   CI26213              SI2634   1999-11-15
16556                   8   CI26214              SI2634   1999-11-17
16557                   9   CI26216              SI2634   1999-11-24
16558                  10   CI26212              SI2634   1999-11-12
16559                  11   CI26218              SI2634   1999-12-01
16560                  12   CI26219              SI2634   1999-12-03
16561                  13   CI26221              SI2634   1999-12-08

In [28]:
## check what is the first year of when the user solved a challenge
df_train['year'] = df_train['publish_date'].apply(lambda x: int(x[:4]))
print (df_train.loc[df_train['challenge_sequence'] == 1, :].groupby(['year']).count()['user_id'].reset_index())

    year  user_id
0   1999    10124
1   2000        4
2   2001      799
3   2002     2282
4   2003     6216
5   2004    10624
6   2005     9854
7   2006    18502
8   2007     7767
9   2008     1938
10  2009     1422

In [50]:
## checkd if the users with first challenge in 1999, have last challenge also in 1999
print (df_train.loc[(df_train['year'] == 1999) & (df_train['challenge_sequence'].isin([1, 13])), :].\
       groupby(['user_id']).sum()['challenge_sequence'].reset_index().\
       groupby(['challenge_sequence']).count()['user_id'].reset_index())

   challenge_sequence  user_id
0                   1     6994
1                  13     1223
2                  14     3130